import { Card } from "@/components/common/card";
import { Disclosure } from "@headlessui/react";
import { MinusIcon } from "@heroicons/react/20/solid";
import { PlusIcon } from "@heroicons/react/24/outline";

export default function Bleaching() {
  const signsToTakeTreatment = [
    {
      icon: "/bleaching/warm-water.svg",
      title: "لثه خود را با آب گرم، تمیز و به آرامی ماساژ دهید.",
    },
    {
      icon: "/bleaching/avoid-smoking.svg",
      title: "از استعمال دخانیات خودداری کنید.",
    },
    {
      icon: "/bleaching/avoid-colorful-snack.svg",
      title: "از خوردن مواد غذایی حاوی رنگدانه خودداری نمایید",
    },
    {
      icon: "/bleaching/decent-toothpaste.svg",
      title: " از خمیردندان ضد حساسیت استفاده نمایید( این حساسیت موقتی است.)",
    },
    {
      icon: "/bleaching/avoid-cold.svg",
      title: " از مصرف غذاهای سرد خودداری نمائید.",
    },
    {
      icon: "/bleaching/milk.svg",
      title: " از لبنیات، برنج و نان و سیب‌زمینی و استفاده نمایید.",
    },
  ];

  const bleachingMethods = [
    {
      question:
        "Office Bleaching یا بلیچینگ در کلینیک دندانپزشکی این روش از بلیچینگ در مطب دندانپزشک توسط متخصص بلیچینگ انجام شده و از مواد شیمیایی مخصوص با غلظت بالا و مدت زمان کوتاه استفاده می شود. دندانپزشک دندان های شما را با محلول اسیدی آغشته یا اصطلاحا اچ می کند پس...  ",
      content:
        "یا بلیچینگ در کلینیک دندانپزشکی این روش از بلیچینگ در مطب دندانپزشک توسط متخصص بلیچینگ انجام شده و از مواد شیمیایی مخصوص با غلظت بالا و مدت زمان کوتاه استفاده می شود. دندانپزشک دندان های شما را با محلول اسیدی آغشته یا اصطلاحا اچ می کند سپس یک ماده اکسید کننده به مینای دندان شما می زند. سپس دندان ها را در معرض نور شدید یا لیزر قرار می دهند( این روش با نام بلچینگ دندان با لیزر هم شناخته می شود). انجام کامل بلیچینگ در این روش معمولا سه تا چهار جلسه طول می کشد و هر جلسه هم حدودا 30 الی 60 دقیقه زمان می برد. دندانپزشکی که شما به آن مراجعه می کنید باید مهارت کافی در این زمینه داشته باشد تا مواد شیمیایی باعث ایجاد حساسیت و ناراحتی همچون درد لثه و دندان درد نشود. دندانپزشک برای جلوگیری از تماس مواد اکسید کننده با لثه، از ژل های محافظت کننده استفاده می کند که با یک نور آبی آن را روی دندان در طی مدت زمان انجام بلیچینگ، ثابت نگه می دارد. هزینه بلیچینگ دندان در کلینیک دندان پزشکی نسبت به خانه معمولا گران تر است. البته به موادی هم که برای بلیچینگ استفاده می شود هم بستگی دارد. بلیچینگ فوری دندان یک روش جدید که اخیرا برای بلیچینگ فوری دندان انجام می شود، پاور بلیچینگ یا سفید کننده نیرو نام دارد که در آن از هیدروژن پراکسید غلیظ استفاده می شود. استفاده از این روش می تواند دندان های شما را فقط در یک جلسه به صورت کامل سفید کند. اما توجه داشته باشید که دندان های شما به صورت موقت سفید می شوند و بعد از یک تا سه سال دوباره تیره می شوند و ممکن است لازم باشد دوباره این روش را تکرار کنید.",
    },
    {
      question:
        "Home Bleaching  یا بلیچینگ دندان در خانه این روش بلیچینگ زیر نظر دندانپزشک در منزل و توسط خود فرد انجام می شود. نوع ماده ای که در این روش استفاده می شود، با ماده ای که در مطب توسط دندانپزشک استفاده می شود، متفاوت است. در این روش دندانپزشک از یک قالب از دندان های فرد تهیه کرده و در ",
      content:
        "Home Bleaching  یا بلیچینگ دندان در خانه این روش بلیچینگ زیر نظر دندانپزشک در منزل و توسط خود فرد انجام می شود. نوع ماده ای که در این روش استفاده می شود، با ماده ای که در مطب توسط دندانپزشک استفاده می شود، متفاوت است. در این روش دندانپزشک از یک قالب از دندان های فرد تهیه کرده و در لابراتوار توسط آن قالب، تری پلاستیکی (نایت گارد) ساخته می شود. ژل بلیچینگ درون قالب نایت گارد ریخته شده و روی دندان قرار داده می شود. مدت زمانی که باید قالب روی دندان ها قرار گیرد بسته به وضعیت دندان های فرد، بین یک الی شش ساعت در روز است. کل پروسه یک دوره درمانی بین یک الی دو هفته برای هر فک می باشد. زیرا در هر بار باید فقط روی یکی از فک ها، قالب قرار گیرد. این روش صبر و حوصله شخص را می طلبد. چنانچه شخص فرصت کافی نداشته و بخواهد بلیچینگ دندان را سریع و در کوتاه ترین زمان انجام دهد، بهتر است این کار را در مطب دندانپزشکی انجام دهد. هزینه این روش نسبت به بلیچینگ دندان در کلینیک دندانپزشکی ارزان تر است. لازم به ذکر است.",
    },
  ];

  const questions = [
    {
      question: " در چه سنی می‌توان بلیچینگ دندان را انجام داد؟",
      answer:
        "بلیچینگ دندان را برای تمامی افراد بالای ۱۸ سال می‌توان انجام داد. از آنجایی که قبل از سن ۱۸ سالگی دندان‌ها هنوز عاج و مینای بالغ شده‌ای ندارند، این درمان می‌تواند موجب حساسیت‌های دندانی شود.",
    },
    {
      question: "میزان سفید شدن دندان‌ها بعد از بلیچینگ دندان چقدر است؟",
      answer:
        "میزان قطعی برای سفید شدن دندان‌ها بعد از بلیچینگ دندان را نمی‌توان اعلام کرد، چرا که بسته به میزان بد رنگی دندان و جنس دندان بیمار ممکن است، دندان‌ها از یک تا چند درجه تغییر رنگ داشته باشند.",
    },
    {
      question: " چه کارهایی را قبل از بلیچینگ دندان باید انجام دهیم؟",
      answer:
        "برای انجام بلیچینگ دندان بهتر است جهت ترمیم پوسیدگی‌ها و جرمگیری به دندانپزشک مراجعه کنید تا نتیجه بهتری از درمان سفید کردن دندان‌ها حاصل شود.",
    },
    {
      question: "آیا نور دستگاه بلیچینگ دندان ضرر دارد؟",
      answer:
        "از نظر پزشکی، تمامی نورهایی که به صورت مستقیم به چشم تابانده می‌شوند، می‌توانند خطراتی را در پی داشته باشند. اما نوری که در دستگاه بلیچینگ در کلینیک‌های دندانپزشکی مورد استفاده قرار می‌گیرد، هالوژن‌های متمرکز شده و بی‌خطر است.",
    },
    {
      question: "بلیچینگ دندان چقدر طول می‌کشد؟",
      answer:
        "اگر روش آفیس انتخاب شود، طی ۲ الی ۳ جلسه به مدت ۴۵ دقیقه، و اگر روش انتخابی در منزل باشد، حدود ۲ الی ۳ هفته به طول می‌انجامد.",
    },
    {
      question: " آیا بلیچینگ دندان به مینای دندان آسیب می‌زند؟",
      answer:
        "اگر تغییر رنگ دندان و لکه‌های دندانی در لایه‌های عمیق مینای دندان اتفاق افتاده باشد، ممکن است دندانپزشک درمانی تکمیلی برای سایش لایه نازکی از مینای دندان را تجویز کند. در غیر این صورت بلیچینگ دندان بدون هیچ آسیبی به مینای دندان، قابل انجام است.",
    },
    {
      question: "آیا بلیچینگ دندان دائمی است؟",
      answer:
        "به طور کلی روش‌های زیبایی در دندانپزشکی دائمی نبوده و بعد از مدت زمانی به ترمیم نیاز دارند. با این حال اگر بهداشت دهان و دندان به درستی رعایت شود، ماندگاری آن نیز افزایش پیدا می‌کند.",
    },
  ];
  return (
    <main className="container mt-[150px] mb-20">
      <h1 className="text-center mb-8">بلیچینگ دندان (Dental Bleaching) </h1>
      <p className="mb-4">
        انواع روش های انجام بلیچینگ دندان بلیچینگ دندان با دو روش قابل انجام
        است:
      </p>

      {bleachingMethods.map((item: any, index: number) => {
        return (
          <Disclosure key={item.question}>
            {({ open }) => (
              <div className="rounded-2xl shadow-card p-5 mb-6">
                <Disclosure.Button className="flex items-center justify-between w-full text-right focus:outline-0 ">
                  {index === 0 ? (
                    <img src="/bleaching/home-plus.svg" alt="" />
                  ) : (
                    <img src="/bleaching/home.svg" alt="" />
                  )}
                  {open ? <div /> : item.question}
                  {open ? (
                    <MinusIcon className={`h-5 w-5 text-primary_100`} />
                  ) : (
                    <PlusIcon className={` h-5 w-5 text-primary_100`} />
                  )}
                </Disclosure.Button>
                <Disclosure.Panel className="text-gray-500 mt-5">
                  {item.content}
                </Disclosure.Panel>
              </div>
            )}
          </Disclosure>
        );
      })}
      <p className="flex items-center mt-8 before:content-info before:inline-block before:h-[24px]">
        قبل از بکار گیری هر کدام از روش های بلیچینگ، باید دندانهایی که پوسیده و
        دچار مشکل شده اند، ترمیم و جرم گیری صورت گیرد.{" "}
      </p>
      <h2 className="mb-4 mt-12">مراقبت های بعد از بلیچینگ دندان</h2>
      <div className="flex flex-wrap items-stretch gap-3 justify-center">
        {signsToTakeTreatment.map((item: any) => {
          return <Card item={item} key={item.icon} />;
        })}
      </div>
      <p className="mt-10">
        باید در نظر داشت که نتیجه این شیوه قابل پیش‌بینی نیست، بسته به لک‌دندان،
        سن و وراثت متفاوت است. در نتیجه با قطعیت از نتیجه این شیوه نمی توان سخن
        گفت و بهتر از قبل از تصمیم گیری با پزشک متخصص خود مشورت کنید.
      </p>
      <h2 className="mb-4 mt-8">سوالات متداول</h2>

      {questions.map((item: any, index: number) => {
        return (
          <Disclosure key={item.question}>
            {({ open }) => (
              <div className="rounded-2xl shadow-card p-5 mb-6">
                <Disclosure.Button className="flex items-center justify-between w-full text-right focus:outline-0 text-primary_100">
                  {index + 1}. {item.question}
                  {open ? (
                    <MinusIcon className={`h-5 w-5 text-primary_100`} />
                  ) : (
                    <PlusIcon className={` h-5 w-5 text-primary_100`} />
                  )}
                </Disclosure.Button>
                <Disclosure.Panel className="text-gray-500 mt-5">
                  {item.answer}
                </Disclosure.Panel>
              </div>
            )}
          </Disclosure>
        );
      })}
    </main>
  );
}
