import { Card } from "@/components/common/card";
import { Disclosure } from "@headlessui/react";
import { MinusIcon } from "@heroicons/react/20/solid";
import { PlusIcon } from "@heroicons/react/24/outline";

export default function Treatment() {
  const signsToTakeTreatment = [
    {
      icon: "/treatment/toothache.svg",
      title: "دندان درد شدید",
    },
    {
      icon: "/treatment/cavities.svg",
      title: "سوراخ شدن دندان",
    },
    {
      icon: "/treatment/sensitive.svg",
      title: "حساسیت به سرما و گرما",
    },
    {
      icon: "/treatment/scar.svg",
      title: "وجود لکه‌ یا نقاط تیره روی دندان",
    },
  ];

  const after = [
    {
      icon: "/treatment/avoid-soda.svg",
      title: "عدم مصرف نوشیدنی یا خوراکی  تا برطرف شدن بی‌حسی",
    },
    {
      icon: "/treatment/brush-toothstring.svg",
      title: "استفاده از نخ دندان و مسواک",
    },
    {
      icon: "/treatment/avoid-hard-snack.svg",
      title: "عدم خوردن خوراکی‌های سفت",
    },
    {
      icon: "/treatment/lay-seated.svg",
      title: "به صورت نیم خیز استراحت کنید",
    },
  ];

  const questions = [
    {
      question: "آیا پر کردن دندان درد دارد؟",
      answer:
        "یکی از مهم‌ترین سوالاتی که بیماران در خصوص پر کردن دندان دارند احساس درد است. می‌توان گفت با توجه به نوع و عمق پوسیدگی دندان روند درمان کمی متفاوت می‌شود. با این وجود به دلیل استفاده از بیحسی موضعی معمولاً بیمار دردی در حین پر کردن دندان احساس نمی‌کند. بعد از اتمام درمان هم ممکن است تنها در حد حساسیت‌هایی در اطراف دندان پر شده احساس شود که در چند روز ابتدایی طبیعی است.",
    },
    {
      question: "چند وقت یکبار برای ویزیت به دندانپزشک مراجعه کنیم؟",
      answer:
        "توصیه می‌شود برای جلوگیری از بروز مشکلات مختلف دهان و دندان به‌صورت سالانه یا حداقل هر دو سال یک‌بار به مطب دندان‌پزشک مراجعه شود تا متخصص دهان و دندان با یک معاینه کامل و بررسی دقیق شرایط تمام دندان‌ها و لثه، انواع خدمات و درمان های دندانپزشکی موردنیاز را توصیه کند. این امر قطعا در کاهش هزینه‌های درمان و خدمات دندانپزشکی نیز مؤثر خواهد بود.",
    },
    {
      question: "از کجا بدانیم دندانمان باید پر شود؟",
      answer:
        "معمولاً دندان درد شایع‌ترین علامت نیاز به پر کردن دندان است اما اگر می‌خواهید پیش از این که دندان تا این حد تخریب شود به داد آن برسید، بهتر است به علائم دیگری مانند حساسیت دندان به سرما یا گرما یا فشار نیز توجه کنید. اگر درد تیر کشنده یا ناگهانی در هنگام جویدن غذا تجربه می‌کنید، ممکن است نیاز به پر کردن دندان داشته باشید.",
    },
    {
      question: "در چه صورت باید پرکردگی دندان را عوض کنیم؟",
      answer:
        "اگر پر کردگی دندان دیگر عملکرد درستی نداشته باشد، ممکن است این وضعیت را با حساسیت دندان یا دندان درد متوجه شوید. بهترین کار این است که سالی یک یا دو بار برای بررسی پر کردگی های دندان به دندانپزشک مراجعه کنید. همچنین به محض بروز علائمی مثل حساسیت دندان یا دندان درد هر چه زودتر دندانپزشک را ببینید تا وضعیت دندان‌ها بررسی شود.",
    },
  ];
  return (
    <main className="container mt-[150px] mb-20">
      <h1 className="text-center mb-4">خدمات درمانی </h1>
      <p>
        پر کردن دندان یک روش دندانپزشکی است که برای ترمیم دندانی که به دلیل
        پوسیدگی، ضربه یا ساییدگی آسیب دیده است استفاده می شود. پس از انجام
        خدمات، رعایت بهداشت دهان و دندان برای جلوگیری از پوسیدگی بیشتر و حفظ
        ماندگاری پرکردگی، بسیار مهم است.
        <br />
        در واقع پر کردن دندان زمانی انجام می‌شود که دندان آسیب دیده باشد چه بر
        اثر پوسیدگی و چه ضربه. با این وجود باید استحکام دندان آسیب دیده تا حدی
        باشد که بتوان آن را ترمیم کرد و به عبارتی دیگر دندان به طور کامل تخریب
        نشده باشد. اینکه چه زمانی لازم است دندان پر یا ترمیم شود، با توجه به
        علائم آن مشخص خواهد شد.
      </p>

      <h2 className="mb-4 mt-8">علائم دندان نیازمند به ترمیم</h2>
      <div className="flex items-stretch gap-3 justify-center">
        {signsToTakeTreatment.map((item: any) => {
          return <Card item={item} key={item.icon} />;
        })}
      </div>
      <h2 className="mb-4 mt-8">عصب‌کشی</h2>
      <p>
        عصب‌کشی دندان روشی است جهت از بین بردن ریشه و عصب دندان، این روش برای
        دندان‌هایی استفاده می‌شود که پوسیدگی عمیق دارند و اصطلاحا به عصب رسیده
        اند. در قدیم چنین دندان‌هایی کشیده می‌شدند اما با پیشرفت علم پزشکی، چنین
        دندان هایی عصب‌کشی می‌شوند و پس از ترمیم دوباره قابل استفاده هستند.
        <br />
        اما دندان هایی که عصب کشی شدند، از لحاظ استحکام ضعیف و دیواره آنها سست و
        شکننده می شود به همین دلیل بعد از عصب‌کشی پیشنهاد می‌شود که حتما از روکش
        دندان استفاده کنید. قیمت عصب کشی و روکش دندان بصورت جداگانه محاسبه می
        شود
      </p>
      <p className="flex items-center mt-8 before:content-info before:inline-block before:h-[24px]">
        عصب کشی در مواردی انجام می شود که پالپ آسیب برگشت ناپذیر دیده است و چاره
        ای به جز تخلیه و تمیز کردن آن و پر کردن آن با مواد پر کننده مخصوص، وجود
        ندارد.
      </p>
      <h2 className="mb-4 mt-12">مراقبت‌های بعد از عصب‌کشی</h2>
      <div className="flex items-stretch gap-3 justify-center">
        {after.map((item: any) => {
          return <Card item={item} key={item.icon} />;
        })}
      </div>
      <h2 className="mb-4 mt-8">پر کردن دندان</h2>
      <p>
        پر کردن دندان معمولاً یکی از رایج‌ترین خدمات دندانپزشکی است؛ در شرایطی
        که دندان هنوز بسیار آسیب ندیده و دارای خرابی‌های جزیی شده است، بهترین
        روش ممکن برای درمان، پر کردن آن است و علاوه بر اینکه از ادامه خرابی
        دندان جلوگیری و باعث عملکرد مناسب آن همانند شرایط طبیعی می شود. مهم است
        که همچنان بعد از پر کردن، برای افزایش طول عمر دندان پر شده مراقبت‌هایی
        انجام شود.{" "}
      </p>
      <h2 className="mb-4 mt-8">سوالات متداول</h2>

      {questions.map((item: any, index: number) => {
        return (
          <Disclosure key={item.question}>
            {({ open }) => (
              <div className="rounded-2xl shadow-card p-5 mb-6">
                <Disclosure.Button className="flex items-center justify-between w-full text-right focus:outline-0 text-primary_100">
                  {index + 1}. {item.question}
                  {open ? (
                    <MinusIcon className={`h-5 w-5 text-primary_100`} />
                  ) : (
                    <PlusIcon className={` h-5 w-5 text-primary_100`} />
                  )}
                </Disclosure.Button>
                <Disclosure.Panel className="text-gray-500 mt-5">
                  {item.answer}
                </Disclosure.Panel>
              </div>
            )}
          </Disclosure>
        );
      })}
    </main>
  );
}
